#有一个列表【北京，上海，广东】
#1.将中国所有省会城市添加到表中
#2.广东成为第二大发达城市，将广东排在上海前面
#3[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]这是中国GDP排名前8的城市的GDP数值，请统计前8城市的GDP总和，平均GDP。
a=["北京","上海","广东"]
b=["石家庄","太原","呼和浩特","沈阳","长春","哈尔滨","南京","杭州","合肥","福州","南昌","济南","郑州","武汉","长沙","广州","南宁","海口","成都","贵阳","昆明","拉萨","西安","兰州","西宁","银川","乌鲁木齐","台北"]
c=0
z=len(b)
while c<z:
    d=b.pop()
    a.append(d)
    c=c+1
print(a)
a.remove("广东")
a.insert(1,"广东")
print(a)

gdp=[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
zh=round(sum(gdp),2)
cd=len(gdp)
pj=zh/cd
print(zh,round(pj,2))

#有以下一个列表，求其中是5的倍数的和
a = [1,5,21,30,15,9,30,24]
c=0
sum=0
d=0
while c<8:
    b = a.pop()
    if b%5 == 0:
        d=b
        sum=d+sum
        c+=1
    else:
        c+=1
print(sum)

#有下列列表，请编程实现列表的数据翻转
List = [1,2,3,4,5,6,7,8,9]
#实现效果：list = [9,8,7,6,5,4,3,2,1]
new=list(reversed(List))#返回的数值重新进行列表编译
print(new)

#请编程统计列表中的每个数字出现的次数
a = [1,4,7,5,8,2,1,3,4,5,9,7,6,1,10]
print("1出现的次数：",a.count(1),"\n2出现的次数：",a.count(2),"\n3出现的次数：",a.count(3),"\n4出现的次数：",a.count(4),"\n5出现的次数：",a.count(5),"\n6出现的次数：",a.count(6),"\n7出现的次数：",a.count(7),"\n8出现的次数：",a.count(8),"\n9出现的次数：",a.count(9),"\n10出现的次数：",a.count(10))




